//-------------------------------------------------
//文字のエフェクト
//-------------------------------------------------

//名前空間//---------------------------------------
using UnityEngine;
using UnityEngine.Events;
using System.Collections;

//クラス//-----------------------------------------
public class TextEffectManager : MonoBehaviour {

	//列挙//---------------------------------------
	public	enum 	EffectID{
		Bon,
	}

	private	int[]	effectCount	= new int[]{4,};

	//変数//---------------------------------------

	//初期化//-------------------------------------
	void Start () {
	
	}

	//更新//---------------------------------------
	void Update () {
	
	}
}
