//-------------------------------------------------
//文字のエフェクト
//-------------------------------------------------

//名前空間//---------------------------------------
using UnityEngine;
using UnityEngine.Events;
using System.Collections;

//クラス//-----------------------------------------
public class TextEffect : MonoBehaviour {

	//変数//---------------------------------------


	//初期化//-------------------------------------
	void Start () {

	}
	
	//更新//---------------------------------------
	void Update () {

	}
	void	UpdateBon(){

	}
}
